# Creating a DataFrame
   - pd.DataFrame() is a combination of rows & columns

### Python Dictionary

In [1]:
# Create a dictionary in python only single entity

# keys ---> columns
# values---> rows

persons = {
    'FName':'Mukesh',
    'LName':'Yadav',
    'Occupation':'Engineer',
    'Location':'Jaipur',
    'PinCode':303106,
    'Hobby':'Reading'
}

In [2]:
persons

{'FName': 'Mukesh',
 'LName': 'Yadav',
 'Occupation': 'Engineer',
 'Location': 'Jaipur',
 'PinCode': 303106,
 'Hobby': 'Reading'}

In [3]:
# Create a dictionary in python using multile entity using pythin lists

persons1 = {
    'FName':['Mukesh','Admin','Raja'],
    'LName':['Yadav', 'admin','Sastri'],
    'Occupation':['Engineer','Product Ownor','Architect'],
    'Location':['Jaipur', 'Delhi', 'Pink city'],
    'PinCode':['303106', '302020', '302016'],
    'Hobby':['Reading', 'Study','playing']
             }

In [4]:
persons1

{'FName': ['Mukesh', 'Admin', 'Raja'],
 'LName': ['Yadav', 'admin', 'Sastri'],
 'Occupation': ['Engineer', 'Product Ownor', 'Architect'],
 'Location': ['Jaipur', 'Delhi', 'Pink city'],
 'PinCode': ['303106', '302020', '302016'],
 'Hobby': ['Reading', 'Study', 'playing']}

In [5]:
persons1['FName'][2]

'Raja'

### Create a DataFrame

In [6]:
# Create a DataFrame
import pandas as pd

In [7]:

df = pd.DataFrame(persons1)
df

    FName   LName     Occupation   Location PinCode    Hobby
0  Mukesh   Yadav       Engineer     Jaipur  303106  Reading
1   Admin   admin  Product Ownor      Delhi  302020    Study
2    Raja  Sastri      Architect  Pink city  302016  playing

In [8]:
# Accessing a column is same as accessing a value from a dictionary
df['Hobby']

0    Reading
1      Study
2    playing
Name: Hobby, dtype: object

In [9]:
#Even we can access using (. dot) notation like this-
df.Hobby

0    Reading
1      Study
2    playing
Name: Hobby, dtype: object

In [10]:
# Here I will recommend to use 1st approach using [] because sometime columns name might be same as attributes name in that case dot natation will give error.
# eg. if data frame has a column name as count and accessing that using . notation will give error

In [11]:
# Check the type of the column-
type(df['Hobby'])

pandas.core.series.Series

In [12]:
#Series basically a list of data but like a data frame it has more functionality

### Access multiple columns from data frame-

In [13]:
df[['FName','Location','Hobby']]

    FName   Location    Hobby
0  Mukesh     Jaipur  Reading
1   Admin      Delhi    Study
2    Raja  Pink city  playing

In [14]:
#To check list of columns
df.columns

Index(['FName', 'LName', 'Occupation', 'Location', 'PinCode', 'Hobby'], dtype='object')

###  Access rows 
   - loc - searching by label
   - iloc - Allows us to access rows by using integer location

In [15]:
df.iloc[1]

FName                 Admin
LName                 admin
Occupation    Product Ownor
Location              Delhi
PinCode              302020
Hobby                 Study
Name: 1, dtype: object

In [16]:
# Access multiple rows
df.iloc[[0,1]]

    FName  LName     Occupation Location PinCode    Hobby
0  Mukesh  Yadav       Engineer   Jaipur  303106  Reading
1   Admin  admin  Product Ownor    Delhi  302020    Study

In [17]:
# we can also specify the column index for which we need data, 1st [] are for rows and 2nd [] for column index 
df.iloc[[0,1], 3]

0    Jaipur
1     Delhi
Name: Location, dtype: object

In [18]:
df

    FName   LName     Occupation   Location PinCode    Hobby
0  Mukesh   Yadav       Engineer     Jaipur  303106  Reading
1   Admin   admin  Product Ownor      Delhi  302020    Study
2    Raja  Sastri      Architect  Pink city  302016  playing

In [19]:
#Similarly we can use loc- we can mention the column name
df.loc[[0,1], 'PinCode']

0    303106
1    302020
Name: PinCode, dtype: object

In [20]:
# in the above line I've mentioned only 1 column name, if you want to access multiple column than pass list of columns

df.loc[[0,1], ['Hobby','FName']]

     Hobby   FName
0  Reading  Mukesh
1    Study   Admin

### Set Reset and use Index 
   - index selection should be unique

In [21]:
#Basically select the unique column for the index like empID columns or emailID

df.set_index('Hobby')

          FName   LName     Occupation   Location PinCode
Hobby
Reading  Mukesh   Yadav       Engineer     Jaipur  303106
Study     Admin   admin  Product Ownor      Delhi  302020
playing    Raja  Sastri      Architect  Pink city  302016

In [22]:
df

    FName   LName     Occupation   Location PinCode    Hobby
0  Mukesh   Yadav       Engineer     Jaipur  303106  Reading
1   Admin   admin  Product Ownor      Delhi  302020    Study
2    Raja  Sastri      Architect  Pink city  302016  playing

In [23]:
# To reflect the changes in the original data frame - 

df.set_index('Hobby', inplace=True)

In [24]:
df

          FName   LName     Occupation   Location PinCode
Hobby
Reading  Mukesh   Yadav       Engineer     Jaipur  303106
Study     Admin   admin  Product Ownor      Delhi  302020
playing    Raja  Sastri      Architect  Pink city  302016

In [25]:
# Previous we're using index from 0--n to access the rows but now we have set the new index so access like below-

df.loc['Reading']

FName           Mukesh
LName            Yadav
Occupation    Engineer
Location        Jaipur
PinCode         303106
Name: Reading, dtype: object

In [26]:
# But the index access from 0--n will work with iloc

df.iloc[0]

FName           Mukesh
LName            Yadav
Occupation    Engineer
Location        Jaipur
PinCode         303106
Name: Reading, dtype: object

In [27]:
# For reset index

df.reset_index(inplace=True)
df

     Hobby   FName   LName     Occupation   Location PinCode
0  Reading  Mukesh   Yadav       Engineer     Jaipur  303106
1    Study   Admin   admin  Product Ownor      Delhi  302020
2  playing    Raja  Sastri      Architect  Pink city  302016

### Filtering  - Using conditionals to filter Rows & Columns

In [28]:
df['Hobby'] == 'Reading'

0     True
1    False
2    False
Name: Hobby, dtype: bool

In [29]:
# Assign filter condition to our entire data frame - 

filterObj = (df['Hobby'] == 'Reading')

In [30]:
#1st approach to assign to data frame - 

df[filterObj]

     Hobby   FName  LName Occupation Location PinCode
0  Reading  Mukesh  Yadav   Engineer   Jaipur  303106

In [31]:
#2nd approach to assign to data frame - 

df[df['Hobby'] == 'Reading']

     Hobby   FName  LName Occupation Location PinCode
0  Reading  Mukesh  Yadav   Engineer   Jaipur  303106

In [32]:
#3rd approach to assign to data frame -  
# I prefer this approach bcz in the loc still we can do filtering based on the labels 


df.loc[filterObj]

#df.loc[filterObj, 'Location'] here Location is the column name, so the records which satisfy the boolean condition based on the column will appear here.

     Hobby   FName  LName Occupation Location PinCode
0  Reading  Mukesh  Yadav   Engineer   Jaipur  303106

In [33]:
# We can have many filtering condition using and(&), or(|) 

filerObj = (df['Hobby']=='Reading') & (df['FName']=='Mukesh')

#filerObj = (df['Hobby']=='Study') | (df['FName']=='Admin')

In [34]:
df.loc[filerObj]

     Hobby   FName  LName Occupation Location PinCode
0  Reading  Mukesh  Yadav   Engineer   Jaipur  303106

In [35]:
# Also we can do a negative condition
df.loc[~filerObj, 'Occupation']

1    Product Ownor
2        Architect
Name: Occupation, dtype: object

### Updating rows and columns 
   - Modify data within the data frame

In [36]:
df

     Hobby   FName   LName     Occupation   Location PinCode
0  Reading  Mukesh   Yadav       Engineer     Jaipur  303106
1    Study   Admin   admin  Product Ownor      Delhi  302020
2  playing    Raja  Sastri      Architect  Pink city  302016

In [37]:
# I can see columns name and here I want to update some other name of the columns

df.columns = ['User_Hobby', 'First_Name', 'Last_Name', 'Emp_Occupation', 'User-Location','AreaCode']
df

  User_Hobby First_Name Last_Name Emp_Occupation User-Location AreaCode
0    Reading     Mukesh     Yadav       Engineer        Jaipur   303106
1      Study      Admin     admin  Product Ownor         Delhi   302020
2    playing       Raja    Sastri      Architect     Pink city   302016

In [38]:
# If there's a requirment of updating the column name as uppe or lower, we can use list comprehension

df.columns = [x.upper() for x in df.columns]
df

  USER_HOBBY FIRST_NAME LAST_NAME EMP_OCCUPATION USER-LOCATION AREACODE
0    Reading     Mukesh     Yadav       Engineer        Jaipur   303106
1      Study      Admin     admin  Product Ownor         Delhi   302020
2    playing       Raja    Sastri      Architect     Pink city   302016

In [39]:
# If you want to replace (_) from the columns -

df.columns = df.columns.str.replace('_', ' ') # Here I replaced _ with space.
df

  USER HOBBY FIRST NAME LAST NAME EMP OCCUPATION USER-LOCATION AREACODE
0    Reading     Mukesh     Yadav       Engineer        Jaipur   303106
1      Study      Admin     admin  Product Ownor         Delhi   302020
2    playing       Raja    Sastri      Architect     Pink city   302016

In [40]:
# Also We can use dictionary for columns replacement/changes, here i am reverting back to the original columns changes.

df.rename(columns={
    'USER HOBBY': 'User_Hobby',
    'FIRST NAME':'First_Name',
    'LAST NAME':'Last_Name',
    'EMP OCCUPATION': 'Emp_Occupation',
    'USER-LOCATION':'User_Location',
    'AREACODE':'AreaCode'
    
}, inplace=True)
df

  User_Hobby First_Name Last_Name Emp_Occupation User_Location AreaCode
0    Reading     Mukesh     Yadav       Engineer        Jaipur   303106
1      Study      Admin     admin  Product Ownor         Delhi   302020
2    playing       Raja    Sastri      Architect     Pink city   302016

In [41]:
# So far we have seen that we did columns modifications now i want to update the rows of the data
# last name Satri i want to change it to 'Agarwal'
df

  User_Hobby First_Name Last_Name Emp_Occupation User_Location AreaCode
0    Reading     Mukesh     Yadav       Engineer        Jaipur   303106
1      Study      Admin     admin  Product Ownor         Delhi   302020
2    playing       Raja    Sastri      Architect     Pink city   302016

In [42]:
df.loc[2]

User_Hobby          playing
First_Name             Raja
Last_Name            Sastri
Emp_Occupation    Architect
User_Location     Pink city
AreaCode             302016
Name: 2, dtype: object

In [43]:
# so i can use many approaches - let's use list

df.loc[2] = ['Playing', 'Ashish Raja', 'Agarwal', 'Developer', 'Sastri Nagar','302016']

df

  User_Hobby   First_Name Last_Name Emp_Occupation User_Location AreaCode
0    Reading       Mukesh     Yadav       Engineer        Jaipur   303106
1      Study        Admin     admin  Product Ownor         Delhi   302020
2    Playing  Ashish Raja   Agarwal      Developer  Sastri Nagar   302016

In [44]:
# So by using above approach we can change the columns but what if we have lots of columns and there we want to change only any specific column

# Here 2 is the row num (Index) and next is columns name

df.loc[2, ['First_Name', 'Last_Name']] = ['RAJA', 'Admin']
df

  User_Hobby First_Name Last_Name Emp_Occupation User_Location AreaCode
0    Reading     Mukesh     Yadav       Engineer        Jaipur   303106
1      Study      Admin     admin  Product Ownor         Delhi   302020
2    Playing       RAJA     Admin      Developer  Sastri Nagar   302016

In [45]:
# instead of list I want to change the only last name alone for index 2

df.loc[2, 'Last_Name'] = 'ADMIN '

df

# Also instead of loc I can use at, I'll recommend only loc & iloc
#df.at[2, 'Last_Name'] = 'ADMIN1'

  User_Hobby First_Name Last_Name Emp_Occupation User_Location AreaCode
0    Reading     Mukesh     Yadav       Engineer        Jaipur   303106
1      Study      Admin     admin  Product Ownor         Delhi   302020
2    Playing       RAJA    ADMIN       Developer  Sastri Nagar   302016

In [46]:
# Best approach to use filter conditions, by using below syntax it won't set the vlaues bcz pandas triying to do this operation on a view.

filt = (df['Last_Name'] == 'ADMIN')
df[filt]['Last_Name'] = 'Mukesh'

df

  User_Hobby First_Name Last_Name Emp_Occupation User_Location AreaCode
0    Reading     Mukesh     Yadav       Engineer        Jaipur   303106
1      Study      Admin     admin  Product Ownor         Delhi   302020
2    Playing       RAJA    ADMIN       Developer  Sastri Nagar   302016

In [47]:
filt = (df['Last_Name'] == 'ADMIN')
df.loc[filt, 'Last_Name'] = 'Hello'

In [48]:
df

  User_Hobby First_Name Last_Name Emp_Occupation User_Location AreaCode
0    Reading     Mukesh     Yadav       Engineer        Jaipur   303106
1      Study      Admin     admin  Product Ownor         Delhi   302020
2    Playing       RAJA    ADMIN       Developer  Sastri Nagar   302016

In [49]:
# I want to change all the upper case to lower case 

df['User_Location'] = df['User_Location'].str.lower()
df

  User_Hobby First_Name Last_Name Emp_Occupation User_Location AreaCode
0    Reading     Mukesh     Yadav       Engineer        jaipur   303106
1      Study      Admin     admin  Product Ownor         delhi   302020
2    Playing       RAJA    ADMIN       Developer  sastri nagar   302016

In [50]:
# so instead of doing above apprach we can use some advanced approaches - 
#apply
#map
#applymap
#replace

# uses of apply()

df['First_Name'].apply(len)


# so here on we can use apply in differnet ways like using function

0    6
1    5
2    4
Name: First_Name, dtype: int64

In [51]:
def update_FirstName(First_Name):
    return First_Name.upper()

df['First_Name'].apply(update_FirstName)

0    MUKESH
1     ADMIN
2      RAJA
Name: First_Name, dtype: object

In [52]:

# But this won't assign these changes to our data frame, so i have to assign it back.
df

  User_Hobby First_Name Last_Name Emp_Occupation User_Location AreaCode
0    Reading     Mukesh     Yadav       Engineer        jaipur   303106
1      Study      Admin     admin  Product Ownor         delhi   302020
2    Playing       RAJA    ADMIN       Developer  sastri nagar   302016

In [53]:
df['First_Name'] = df['First_Name'].apply(update_FirstName)
df

  User_Hobby First_Name Last_Name Emp_Occupation User_Location AreaCode
0    Reading     MUKESH     Yadav       Engineer        jaipur   303106
1      Study      ADMIN     admin  Product Ownor         delhi   302020
2    Playing       RAJA    ADMIN       Developer  sastri nagar   302016

In [54]:
# I can use lambda functiton as well 

df['First_Name'] = df['First_Name'].apply(lambda x: x.lower())
df

  User_Hobby First_Name Last_Name Emp_Occupation User_Location AreaCode
0    Reading     mukesh     Yadav       Engineer        jaipur   303106
1      Study      admin     admin  Product Ownor         delhi   302020
2    Playing       raja    ADMIN       Developer  sastri nagar   302016

In [55]:
# Want to get the minimum value from the column

In [56]:
df.apply(pd.Series.min)

User_Hobby          Playing
First_Name            admin
Last_Name            ADMIN
Emp_Occupation    Developer
User_Location         delhi
AreaCode             302016
dtype: object

In [57]:
# Also i can use lambda function as well

df.apply(lambda x: x.min())

User_Hobby          Playing
First_Name            admin
Last_Name            ADMIN
Emp_Occupation    Developer
User_Location         delhi
AreaCode             302016
dtype: object

In [58]:
#2 . applymap uses -> apply a function to every individual element in dataframe , applymap only works on the data frmes

df.applymap(len)

   User_Hobby  First_Name  Last_Name  Emp_Occupation  User_Location  AreaCode
0           7           6          5               8              6         6
1           5           5          5              13              5         6
2           7           4          6               9             12         6

In [59]:
# so if i want to do all the strings in lower case -

df.applymap(str.lower)

  User_Hobby First_Name Last_Name Emp_Occupation User_Location AreaCode
0    reading     mukesh     yadav       engineer        jaipur   303106
1      study      admin     admin  product ownor         delhi   302020
2    playing       raja    admin       developer  sastri nagar   302016

In [60]:
#3 , map works only on a series object, it substutes the values 

df['First_Name'].map({
    'mukesh' :'Moni',
    'admin': 'Joe'
    
})

0    Moni
1     Joe
2     NaN
Name: First_Name, dtype: object

In [61]:
# in the above approach i can see that 2nd index is showing Nan , bcz i just apply map on mukesh and admin, so to overcome this we can use repalce()

In [62]:
#4 replace()

df['First_Name'] = df['First_Name'].replace({
    'mukesh' :'Moni',
    'admin': 'Joe'
    
})

df

  User_Hobby First_Name Last_Name Emp_Occupation User_Location AreaCode
0    Reading       Moni     Yadav       Engineer        jaipur   303106
1      Study        Joe     admin  Product Ownor         delhi   302020
2    Playing       raja    ADMIN       Developer  sastri nagar   302016

### Add Remove Columns 
  - add and remove columns from the data frames

In [63]:
# Combine columns(first_name & last_name) into single

df['full_name'] = df['First_Name'] + ' '+df['Last_Name']

df

,User_Hobby,First_Name,Last_Name,Emp_Occupation,User_Location,AreaCode,full_name
0,Reading,Moni,Yadav,Engineer,jaipur,303106,Moni Yadav
1,Study,Joe,admin,Product Ownor,delhi,302020,Joe admin
2,Playing,raja,ADMIN,Developer,sastri nagar,302016,raja ADMIN

In [64]:
# If you want to delete columns from df, i can pass list of columns 

df.drop(columns=['full_name'], inplace=True)
df

  User_Hobby First_Name Last_Name Emp_Occupation User_Location AreaCode
0    Reading       Moni     Yadav       Engineer        jaipur   303106
1      Study        Joe     admin  Product Ownor         delhi   302020
2    Playing       raja    ADMIN       Developer  sastri nagar   302016

In [65]:
# so again let me combine the first & last name into one and i 'll delete  these columns'

df['Full_col'] = df['First_Name']+ ' '+['Last_Name']
df

,User_Hobby,First_Name,Last_Name,Emp_Occupation,User_Location,AreaCode,Full_col
0,Reading,Moni,Yadav,Engineer,jaipur,303106,Moni Last_Name
1,Study,Joe,admin,Product Ownor,delhi,302020,Joe Last_Name
2,Playing,raja,ADMIN,Developer,sastri nagar,302016,raja Last_Name

In [66]:
# dropping first & last name column

df.drop(columns=['First_Name', 'Last_Name'], inplace=True)
df

  User_Hobby Emp_Occupation User_Location AreaCode        Full_col
0    Reading       Engineer        jaipur   303106  Moni Last_Name
1      Study  Product Ownor         delhi   302020   Joe Last_Name
2    Playing      Developer  sastri nagar   302016  raja Last_Name

In [67]:
# Now if you want to revert back the changes - again want to add the columns then -  we can use str for this

df['Full_col'].str.split(' ', expand = True)

      0          1
0  Moni  Last_Name
1   Joe  Last_Name
2  raja  Last_Name

In [68]:
# I can see that i got two columns now adding back to original df

df[['First_Name', 'Last_Name']] = df['Full_col'].str.split(' ', expand = True)

In [69]:
# append data in the rows

df.append({'First_Name':'Mannat' },ignore_index= True)

,User_Hobby,Emp_Occupation,User_Location,AreaCode,Full_col,First_Name,Last_Name
0,Reading,Engineer,jaipur,303106,Moni Last_Name,Moni,Last_Name
1,Study,Product Ownor,delhi,302020,Joe Last_Name,Joe,Last_Name
2,Playing,Developer,sastri nagar,302016,raja Last_Name,raja,Last_Name
3,NaN,NaN,NaN,NaN,NaN,Mannat,NaN

In [70]:
# I can append two data frames also

persons3 = {
    'FName':['Mukesh','John'],
    'LName':['Yadav', 'Knack'],
    'Email':['muke@mymail.com', 'john@knack.com']
    
}

df2 = pd.DataFrame(persons3)

In [71]:
df2

    FName  LName            Email
0  Mukesh  Yadav  muke@mymail.com
1    John  Knack   john@knack.com

In [72]:
# Appending df2 into df by seting ignore_index = True

df.append(df2, ignore_index=True)

,User_Hobby,Emp_Occupation,User_Location,AreaCode,Full_col,First_Name,Last_Name,FName,LName,Email
0,Reading,Engineer,jaipur,303106,Moni Last_Name,Moni,Last_Name,NaN,NaN,NaN
1,Study,Product Ownor,delhi,302020,Joe Last_Name,Joe,Last_Name,NaN,NaN,NaN
2,Playing,Developer,sastri nagar,302016,raja Last_Name,raja,Last_Name,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Mukesh,Yadav,muke@mymail.com
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,John,Knack,john@knack.com

In [73]:
# by using above code we can append but we don;t have inplace =True(append() don't have inplace) to commit our changes so we can do this way-
df = df.append(df2, ignore_index=True)
df

,User_Hobby,Emp_Occupation,User_Location,AreaCode,Full_col,First_Name,Last_Name,FName,LName,Email
0,Reading,Engineer,jaipur,303106,Moni Last_Name,Moni,Last_Name,NaN,NaN,NaN
1,Study,Product Ownor,delhi,302020,Joe Last_Name,Joe,Last_Name,NaN,NaN,NaN
2,Playing,Developer,sastri nagar,302016,raja Last_Name,raja,Last_Name,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Mukesh,Yadav,muke@mymail.com
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,John,Knack,john@knack.com

In [74]:
#Lets remove rows

df.drop(index=4)

,User_Hobby,Emp_Occupation,User_Location,AreaCode,Full_col,First_Name,Last_Name,FName,LName,Email
0,Reading,Engineer,jaipur,303106,Moni Last_Name,Moni,Last_Name,NaN,NaN,NaN
1,Study,Product Ownor,delhi,302020,Joe Last_Name,Joe,Last_Name,NaN,NaN,NaN
2,Playing,Developer,sastri nagar,302016,raja Last_Name,raja,Last_Name,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Mukesh,Yadav,muke@mymail.com

In [75]:
# drop rows using conditions

df.drop(index= df[df['Last_Name'] == 'Knack'].index)

# here I used .index at the last bcz I'm using index =, so i need to provide a index value by calculating condition

# Another way to write above code using filter

#filt = df['Last_Name']=='Knack'
#df.drop(index=df[filt].index)

,User_Hobby,Emp_Occupation,User_Location,AreaCode,Full_col,First_Name,Last_Name,FName,LName,Email
0,Reading,Engineer,jaipur,303106,Moni Last_Name,Moni,Last_Name,NaN,NaN,NaN
1,Study,Product Ownor,delhi,302020,Joe Last_Name,Joe,Last_Name,NaN,NaN,NaN
2,Playing,Developer,sastri nagar,302016,raja Last_Name,raja,Last_Name,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Mukesh,Yadav,muke@mymail.com
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,John,Knack,john@knack.com

### Sorting Data

In [78]:
persons3 = {
    'FName':['Mukesh','John','Willie','Shawn'],
    'LName':['Yadav', 'Knack', 'Meeks','Booth'],
    'Email':['muke@mymail.com', 'john@knack.com','Willli@meeks.com','shawn@booth.com']
    
}

sortingData = pd.DataFrame(persons3)
sortingData

    FName  LName             Email
0  Mukesh  Yadav   muke@mymail.com
1    John  Knack    john@knack.com
2  Willie  Meeks  Willli@meeks.com
3   Shawn  Booth   shawn@booth.com

In [79]:
# Lets sort the columns based on the LName

sortingData.sort_values(by='LName')

    FName  LName             Email
3   Shawn  Booth   shawn@booth.com
1    John  Knack    john@knack.com
2  Willie  Meeks  Willli@meeks.com
0  Mukesh  Yadav   muke@mymail.com

In [81]:
# we can sort based on the descending order also-

sortingData.sort_values(by='LName', ascending=False)

    FName  LName             Email
0  Mukesh  Yadav   muke@mymail.com
2  Willie  Meeks  Willli@meeks.com
1    John  Knack    john@knack.com
3   Shawn  Booth   shawn@booth.com

In [82]:
#We can sort multiple columns

sortingData.sort_values(by=['LName','FName'], ascending=False)

    FName  LName             Email
0  Mukesh  Yadav   muke@mymail.com
2  Willie  Meeks  Willli@meeks.com
1    John  Knack    john@knack.com
3   Shawn  Booth   shawn@booth.com

In [83]:
# we can pass multiple boolean conditon also -

sortingData.sort_values(by=['LName','FName'], ascending=[False, True])

#so from above code LName would be sort as Descending order while FName as Ascending

    FName  LName             Email
0  Mukesh  Yadav   muke@mymail.com
2  Willie  Meeks  Willli@meeks.com
1    John  Knack    john@knack.com
3   Shawn  Booth   shawn@booth.com

In [86]:
sortingData

    FName  LName             Email
0  Mukesh  Yadav   muke@mymail.com
1    John  Knack    john@knack.com
2  Willie  Meeks  Willli@meeks.com
3   Shawn  Booth   shawn@booth.com

In [88]:
# Original data is not modified, we have to do inplace=True

sortingData.sort_values(by=['LName','FName'], ascending=[False, True], inplace=True)

sortingData

    FName  LName             Email
0  Mukesh  Yadav   muke@mymail.com
2  Willie  Meeks  Willli@meeks.com
1    John  Knack    john@knack.com
3   Shawn  Booth   shawn@booth.com

In [89]:
# Based on the index we can aslo sort

sortingData.sort_index()

    FName  LName             Email
0  Mukesh  Yadav   muke@mymail.com
1    John  Knack    john@knack.com
2  Willie  Meeks  Willli@meeks.com
3   Shawn  Booth   shawn@booth.com

In [90]:
# Individual column also we can sort

sortingData['Email'].sort_values()

2    Willli@meeks.com
1      john@knack.com
0     muke@mymail.com
3     shawn@booth.com
Name: Email, dtype: object